ici-test-automation-feature-environment-readiness/ic-integration-tests/src/test/resources/captia/dpdokumentopret/ValidRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://skat.dk/begrebsmodel/2009/01/15/">
    <soapenv:Header/>
    <soapenv:Body>
        <ns:DPDokumentOpret_I revision="gero et">
            <ns:Kontekst>
                <!--You may enter ANY elements at this point-->
            </ns:Kontekst>

        </ns:DPDokumentOpret_I>
    </soapenv:Body>
</soapenv:Envelope>